** python
*this assumes spaces only*
defining a func that does the newline
#+BEGIN_SRC emacs-lisp
  (defun my-newline ()
    "This gets down a line and keeps indentation. assumes spaces."
    (interactive)
    (let ((x
	   (save-excursion
	     (forward-line 0)
	     (-(-
		(point)
		(cdr (cons (back-to-indentation) (point) )))))))
      (newline)
      (insert-char ?\s x)))

  (defun my-python-newline ()
    "check char, do shit, then call check-colon on it"
    (interactive)
    (if (eq 0 (buffer-size (current-buffer)))
	(newline)
      (backward-char)
      (let ((x (char-after)))
	(forward-char)
	(my-newline)
	(insert-char ?\s (if (equal x ?:)
			     4
			   0)
		     ))))
#+END_SRC
binding to Enter in python mode
#+BEGIN_SRC emacs-lisp
  (add-hook 'python-mode-hook
	    (lambda ()
	      (local-set-key (kbd "<return>")  'my-python-newline)
	      (setq python-indent 4) ) )
  (setq python-shell-interpreter "python3")
  ;(define-key python-mode-map (kbd "<return>") 'my-newline)
  ;  (define-key global-map (kbd "<return>") 'my-newline)
#+END_SRC

#+RESULTS:
| t | (lambda nil (local-set-key (kbd <return>) (quote my-python-newline))) |

